Repository: louisbertrand22/FlashCards
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Both front and back sides are required!
fr: Les côtés recto et verso sont obligatoires !

source: Flashcard created successfully! (ID: %(card_id)s)
fr: Carte mémoire créée avec succès ! (ID: %(card_id)s)

source: Card not found!
fr: Carte non trouvée !

source: Card difficulty updated successfully!
fr: Difficulté de la carte mise à jour avec succès !

source: Flashcard deleted successfully!
fr: Carte mémoire supprimée avec succès !

source: Card marked as reviewed!
fr: Carte marquée comme révisée !

source: Card needs more practice.
fr: Cette carte nécessite plus de pratique.

source: Never
fr: Jamais

source: Dashboard
fr: Tableau de bord

source: All Cards
fr: Toutes les cartes

source: Create Card
fr: Créer une carte

source: Study
fr: Réviser

source: FlashCards Application - Made with ❤️ using Flask
fr: Application FlashCards - Fait avec ❤️ en utilisant Flask

source: All Flashcards (%(count)s)
fr: Toutes les cartes mémoire (%(count)s)

source: Create New Card
fr: Créer une nouvelle carte

source: Filter by Category:
fr: Filtrer par catégorie :

source: All
fr: Tout

source: Due for Review
fr: À réviser

source: Not Due
fr: Pas encore

source: Front:
fr: Recto :

source: Back:
fr: Verso :

source: Reviews:
fr: Révisions :

source: success
fr: succès

source: Last reviewed:
fr: Dernière révision :

source: Next review:
fr: Prochaine révision :

source: Edit Difficulty
fr: Modifier la difficulté

source: Are you sure you want to delete this card?
fr: Êtes-vous sûr de vouloir supprimer cette carte ?

source: Delete
fr: Supprimer

source: No flashcards found!
fr: Aucune carte mémoire trouvée !

source: Create your first flashcard
fr: Créez votre première carte mémoire

source: to get started.
fr: pour commencer.

source: Create New Flashcard
fr: Créer une nouvelle carte mémoire

source: Front Side (Recto)
fr: Côté recto (Question)

source: Enter the question or prompt...
fr: Entrez la question ou l'indication...

source: This is what you'll see first when studying.
fr: C'est ce que vous verrez en premier lors de la révision.

source: Back Side (Verso)
fr: Côté verso (Réponse)

source: Enter the answer...
fr: Entrez la réponse...

source: This is the answer that will be revealed.
fr: C'est la réponse qui sera révélée.

source: Category
fr: Catégorie

source: e.g., Python, History, Science...
fr: ex : Python, Histoire, Sciences...

source: Optional: Add a category to organize your flashcards.
fr: Optionnel : Ajoutez une catégorie pour organiser vos cartes mémoire.

source: Difficulty Level
fr: Niveau de difficulté

source: Easy (review every 7 days)
fr: Facile (révision tous les 7 jours)

source: Medium (review every 3 days)
fr: Moyen (révision tous les 3 jours)

source: Hard (review every 1 day)
fr: Difficile (révision quotidienne)

source: Choose how often you want to review this card.
fr: Choisissez la fréquence de révision pour cette carte.

source: Cancel
fr: Annuler

source: Create Flashcard
fr: Créer la carte mémoire

source: Tip:
fr: Conseil :

source: Edit Flashcard Difficulty
fr: Modifier la difficulté de la carte

source: Card Preview
fr: Aperçu de la carte

source: Current Difficulty:
fr: Difficulté actuelle :

source: Changing difficulty will reschedule the next review.
fr: Changer la difficulté replanifiera la prochaine révision.

source: Update Difficulty
fr: Mettre à jour la difficulté

source: Total Cards
fr: Total de cartes

source: Total Reviews
fr: Total de révisions

source: Study Progress
fr: Progrès d'étude

source: Cards by Difficulty
fr: Cartes par difficulté

source: Easy
fr: Facile

source: Medium
fr: Moyen

source: Hard
fr: Difficile

source: Review Performance
fr: Performance de révision

source: Success Rate
fr: Taux de réussite

source: Best Streak
fr: Meilleure série

source: Active Streaks
fr: Séries actives

source: Getting Started
fr: Prise en main

source: Quick Actions
fr: Actions rapides

source: Study Now (%(count)s cards due)
fr: Réviser maintenant (%(count)s cartes à réviser)

source: All caught up!
fr: Tout est à jour !

source: View All Cards
fr: Voir toutes les cartes

source: Welcome to FlashCards!
fr: Bienvenue sur FlashCards !

source: You don't have any flashcards yet.
fr: Vous n'avez pas encore de cartes mémoire.

source: Create your first card
fr: Créez votre première carte

source: to get started!
fr: pour commencer !

source: Study Mode
fr: Mode révision

source: Select Category
fr: Sélectionner la catégorie

source: All Categories
fr: Toutes les catégories

source: Filter
fr: Filtrer

source: Clear Filter
fr: Effacer le filtre

source: %(count)s card(s) due for review
fr: %(count)s carte(s) à réviser

source: Card %(index)s of %(total)s
fr: Carte %(index)s sur %(total)s

source: Reveal Answer
fr: Révéler la réponse

source: I Remembered
fr: Je me souviens

source: I Didn't Remember
fr: Je ne me souviens pas

source: Great job!
fr: Excellent travail !

source: You've completed all due flashcards for now.
fr: Vous avez terminé toutes les cartes à réviser pour le moment.

source: Return to Dashboard
fr: Retour au tableau de bord

source: You don't have any flashcards due for review right now.
fr: Vous n'avez aucune carte à réviser pour le moment.
